In [1]:
import pandas as pd
d=pd.read_csv('town.csv')
d.head()

  town    area     price
0    m  2600.0  550000.0
1    m  3000.0  565000.0
2    m  3200.0  610000.0
3    m  3600.0  680000.0
4    m  4000.0  725000.0

In [9]:
dummie=pd.get_dummies(d.town)

In [10]:
 merge=pd.concat([d,dummie],axis='columns')

In [11]:
merge

     town    area     price  m  r  w
0       m  2600.0  550000.0  1  0  0
1       m  3000.0  565000.0  1  0  0
2       m  3200.0  610000.0  1  0  0
3       m  3600.0  680000.0  1  0  0
4       m  4000.0  725000.0  1  0  0
...   ...     ...       ... .. .. ..
4595  NaN     NaN       NaN  0  0  0
4596  NaN     NaN       NaN  0  0  0
4597  NaN     NaN       NaN  0  0  0
4598  NaN     NaN       NaN  0  0  0
4599  NaN     NaN       NaN  0  0  0

[4600 rows x 6 columns]

In [15]:
 final=merge.drop(['town','m'],axis='columns')

In [16]:
final

        area     price  r  w
0     2600.0  550000.0  0  0
1     3000.0  565000.0  0  0
2     3200.0  610000.0  0  0
3     3600.0  680000.0  0  0
4     4000.0  725000.0  0  0
...      ...       ... .. ..
4595     NaN       NaN  0  0
4596     NaN       NaN  0  0
4597     NaN       NaN  0  0
4598     NaN       NaN  0  0
4599     NaN       NaN  0  0

[4600 rows x 4 columns]

In [23]:
final=final.dropna(axis=0)

In [25]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model.fit(final[['area','r','w']],final.price)

LinearRegression()

In [30]:
import numpy as np
inp=np.array([2800,1,0])
t=inp.reshape(1,-1)
pred=model.predict(t)
pred

D:\py\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([590775.63964739])

In [63]:
c=pd.read_csv('car.csv')

In [64]:
c.head()

  car       mi    price  age
0   b  69000.0  18000.0  6.0
1   b  35000.0   3400.0  3.0
2   b  57000.0  26100.0  5.0
3   b  22500.0  40000.0  2.0
4   m  46000.0  31500.0  4.0

In [65]:
dum=pd.get_dummies(c.car)

In [66]:
mer=pd.concat([c,dum],axis='columns')

In [67]:
mer.head()

  car       mi    price  age  a  b  m
0   b  69000.0  18000.0  6.0  0  1  0
1   b  35000.0   3400.0  3.0  0  1  0
2   b  57000.0  26100.0  5.0  0  1  0
3   b  22500.0  40000.0  2.0  0  1  0
4   m  46000.0  31500.0  4.0  0  0  1

In [68]:
fina=mer.drop(['car','m'],axis='columns')

In [69]:
fina

           mi    price  age  a  b
0     69000.0  18000.0  6.0  0  1
1     35000.0   3400.0  3.0  0  1
2     57000.0  26100.0  5.0  0  1
3     22500.0  40000.0  2.0  0  1
4     46000.0  31500.0  4.0  0  0
...       ...      ...  ... .. ..
4595      NaN      NaN  NaN  0  0
4596      NaN      NaN  NaN  0  0
4597      NaN      NaN  NaN  0  0
4598      NaN      NaN  NaN  0  0
4599      NaN      NaN  NaN  0  0

[4600 rows x 5 columns]

In [70]:
fina=fina.dropna()

In [71]:
fina

         mi    price  age  a  b
0   69000.0  18000.0  6.0  0  1
1   35000.0   3400.0  3.0  0  1
2   57000.0  26100.0  5.0  0  1
3   22500.0  40000.0  2.0  0  1
4   46000.0  31500.0  4.0  0  0
5   59000.0  29400.0  5.0  1  0
6   52000.0  32000.0  5.0  1  0
7   72000.0  19300.0  6.0  1  0
8   91000.0  12000.0  8.0  1  0
9   67000.0  22000.0  6.0  0  0
10  83000.0  20000.0  7.0  0  0
11  79000.0  21000.0  7.0  0  0
12  59000.0   3000.0  5.0  0  0

In [83]:
import numpy as np
inp=np.array([86000,7,0,1])
t=inp.reshape(1,-1)
pred=ca.predict(t)
pred

D:\py\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([5196.78247938])

In [82]:
ca.score(x,y)

0.24263107816353602